# Python Basic Codes

In [1]:
a = 33

In [2]:
a

33

In [3]:
"Hello " + "World"

'Hello World'

In [8]:
b = "python "

In [9]:
b+b

'python python '

In [10]:
b*3

'python python python '

In [11]:
x = [1,2,4,5]
y = [4.5,3.2,2.1,1.9]
z = ["apple","mangoes","banana"]

In [12]:
[x,y,z]

[[1, 2, 4, 5], [4.5, 3.2, 2.1, 1.9], ['apple', 'mangoes', 'banana']]

In [13]:
c = 73

In [15]:
c == 72

False

In [16]:
list1 = [3,6,7,4,3,55,6]

In [17]:
list1[0]

3

In [18]:
list1[4]

3

In [19]:
list1[-1]

6

In [20]:
list1[3:]

[4, 3, 55, 6]

In [22]:
list1[::-1]

[6, 55, 3, 4, 7, 6, 3]

In [24]:
if list1[0] == 3:
    print("The first element in the list is 3")
else:
    print("The first element in the list is not 3")

The first element in the list is 3

In [25]:
sum_of_squares = 0
for i in list1:
    sum_of_squares = sum_of_squares + (i**2)
print("The sum of squares of the elements in the list is = ",sum_of_squares)

The sum of squares of the elements in the list is =  3180

In [3]:
age = [42,57,15,14,22,74,66]

In [8]:
for a in age:
    print(a)
    if a >= 18:
        print("Adult")
    else:
        print("Not adult")
    print("---------------")

42
Adult
---------------
57
Adult
---------------
15
Not adult
---------------
14
Not adult
---------------
22
Adult
---------------
74
Adult
---------------
66
Adult
---------------

In [2]:
for i in range(1,30,3):
    print(i)

1
4
7
10
13
16
19
22
25
28

In [5]:
def sq_sum(a,b):
    return (a**2)+(b**2)
x = 5
y = 6
sq_sum(x,y)

61

In [15]:
list1=[]
for i in range(1,5):
    for j in range(1,5):
        n = sq_sum(i,j)
        list1.append(n)
        print(n,end=', ')

2, 5, 10, 17, 5, 8, 13, 20, 10, 13, 18, 25, 17, 20, 25, 32,

## Python for DS

In [14]:
import pandas as pd
import numpy as np

In [16]:
list1

[2, 5, 10, 17, 5, 8, 13, 20, 10, 13, 18, 25, 17, 20, 25, 32]

In [17]:
s1 = pd.Series(list1)

In [18]:
s1

0      2
1      5
2     10
3     17
4      5
5      8
6     13
7     20
8     10
9     13
10    18
11    25
12    17
13    20
14    25
15    32
dtype: int64

In [19]:
s1.index

RangeIndex(start=0, stop=16, step=1)

In [20]:
s1.values

array([ 2,  5, 10, 17,  5,  8, 13, 20, 10, 13, 18, 25, 17, 20, 25, 32],
      dtype=int64)

In [22]:
s1[9:]

9     13
10    18
11    25
12    17
13    20
14    25
15    32
dtype: int64

In [23]:
s1[3:6]

3    17
4     5
5     8
dtype: int64

In [24]:
s1[::-1]

15    32
14    25
13    20
12    17
11    25
10    18
9     13
8     10
7     20
6     13
5      8
4      5
3     17
2     10
1      5
0      2
dtype: int64

In [25]:
s1[:9]

0     2
1     5
2    10
3    17
4     5
5     8
6    13
7    20
8    10
dtype: int64

In [33]:
dset = {'Name':['Rahul','Daniel','Rohit','Michael'],'Age':[21,14,19,30]}

In [34]:
df = pd.DataFrame(data = dset)

In [35]:
df

      Name  Age
0    Rahul   21
1   Daniel   14
2    Rohit   19
3  Michael   30

In [36]:
df.columns

Index(['Name', 'Age'], dtype='object')

In [37]:
df.shape

(4, 2)

In [38]:
df2 = pd.read_csv('temperature.csv')

In [39]:
df2.head()

,locationid,year,month,temp,latitude,longitude,stnelev,station,countryid,country
0,USS0010K01S,2000,4,5.27,39.9000,-110.7500,2773.7,INDIAN_CANYON,US,United States
1,CI000085406,1940,5,18.04,-18.3500,-70.3330,58.0,ARICA,CI,Chile
2,USC00036376,2013,12,6.22,34.3703,-91.1242,61.0,SAINT_CHARLES,US,United States
3,ASN00024002,1963,2,22.93,-34.2833,140.6000,65.5,BERRI_IRRIGATION,AS,Australia
4,ASN00028007,2001,11,NaN,-14.7803,143.5036,79.4,MUSGRAVE,AS,Australia

In [40]:
df2.shape

(100000, 10)

In [41]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 10 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   locationid  100000 non-null  object
 1   year        100000 non-null  int64
 2   month       100000 non-null  int64
 3   temp        85554 non-null   float64
 4   latitude    100000 non-null  float64
 5   longitude   100000 non-null  float64
 6   stnelev     100000 non-null  float64
 7   station     100000 non-null  object
 8   countryid   100000 non-null  object
 9   country     99995 non-null   object
dtypes: float64(4), int64(2), object(4)
memory usage: 7.6+ MB

In [42]:
df2.isnull().sum()

locationid        0
year              0
month             0
temp          14446
latitude          0
longitude         0
stnelev           0
station           0
countryid         0
country           5
dtype: int64

In [43]:
df2.nunique()

locationid    24528
year            270
month            12
temp           6026
latitude      16110
longitude     19233
stnelev        5424
station       23167
countryid       237
country         236
dtype: int64

In [49]:
df2[(df2['country']=='India')]

,locationid,year,month,temp,latitude,longitude,stnelev,station,countryid,country
12,IN001111200,1941,12,NaN,16.200,81.150,3.0,MACHILIPATNAM,IN,India
90,IN012141800,1956,5,35.65,21.100,79.050,310.0,NAGPUR_SONEGAON,IN,India
304,IN020040900,1879,10,28.17,13.000,80.183,16.0,MADRAS_MINAMBAKKAM,IN,India
430,IN012020100,1891,10,25.40,20.700,77.033,282.0,AKOLA,IN,India
450,IN011020300,1928,10,25.24,19.083,82.033,553.0,JAGDALPUR,IN,India
...,...,...,...,...,...,...,...,...,...,...
99048,IN001090500,1978,1,22.06,18.767,79.433,156.0,RAMGUNDAM,IN,India
99689,IN009010100,1913,11,21.88,12.967,77.583,921.0,BANGALORE,IN,India
99718,IN001111200,1953,8,29.69,16.200,81.150,3.0,MACHILIPATNAM,IN,India
99769,INXLT811965,1904,2,7.44,27.050,88.270,9999.0,DARJEELING,IN,India
99909,IN023261300,1952,9,NaN,26.750,83.367,77.0,GORAKHPUR,IN,India

In [44]:
df2['country'].value_counts()

United States                       47159
Canada                               9668
Russia                               4724
Australia                            4672
Germany                              2951
                                    ...
Brunei                                  1
Saint Vincent and the Grenadines        1
Montserrat                              1
Equatorial Guinea                       1
Hong Kong                               1
Name: country, Length: 236, dtype: int64

In [53]:
country_temp = df2.groupby('country')['temp'].mean().sort_values(ascending=False).head(10)
country_temp = country_temp.reset_index()

In [54]:
country_temp

     country       temp
0       Mali  29.371772
1      Niger  29.190250
2  Dijibouti  29.150000
3      Yemen  28.934286
4   Maldives  28.553333
5       Chad  28.507353
6   Dominica  28.385000
7      Nauru  28.330000
8     Tuvalu  28.151538
9      Sudan  27.973118